# TrussMemberInfo Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TrussMemberInfo Properties
TrussMemberInfo Class See Also
---
The TrussMemberInfo type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| hostTrussId | The host truss' ElementId of the member. |
| lockedToTruss | Whether the member is locked to the host truss. |
| memberTypeKey | Kind of the member in the truss. |

# See Also
TrussMemberInfo Class
Autodesk.Revit.DB.Structure Namespace